s="грицик полина игоревна завершил ежегодный съезд эрудированных школьников мечтающих глубоко проникнуть в тайны физических явлений и химических реакций"
# всего символов 149 
 alph = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ы', 'э', 'ю', 'я']
alph.each do |ch|
	if ch == 'e'
		puts "#{ch}: #{((s.scan(/#{ch}/).count + s.scan(/ё/).count)/149.0).round(3)}"
	elsif ch == 'ь'
		puts "#{ch}: #{((s.scan(/#{ch}/).count + s.scan(/ъ/).count)/149.0).round(3)}"	
	else
		puts "#{ch}: #{(s.scan(/#{ch}/).count/149.0).round(3)}" 
	end
end
puts (s.scan(/\s/).count/149.0).round(3) 

